Revit 2024 API
RebarBendingDetailType Properties
The RebarBendingDetailType type exposes the following members.
Properties
Name | Description
AngularDimensionsDisplayOption
 Identifies the angular dimensions display options.
AngularDimensionsEnabled
 Identifies if any angular dimensions will be shown or not.
AngularDimensionsForHooksEnabled
 Identifies if the angular dimensions which has a reference set on a hook will be shown or not.
AngularDimensionsMeasurementOptions
 Identifies the measurement option for angular dimensions.
AngularDimensionsOffset
 Identifies the offset of the angular dimensions.
AngularDimensionTextPosition
 Identifies the text position with respect to dimension line.
AngularDimensionTypeId
 Identifies the Id of the angular dimension type which is used to show dimensions.
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BendDiameterDimensionsEnabled
 Identifies if any radial or diameter dimensions will be shown or not.
BendDiameterDimensionsForHooksEnabled
 Identifies if radial or diameter dimensions will be shown for hook fillets. This property has a meaning only if BendDiameterDimensionsEnabled is set to true.
BendDiameterDimensionsForSegmentsEnabled
 Identifies if radial or diameter dimensions will be shown for the bends between segments. Radial or diameter dimesions for arc segments will be shown by default. This property has a menaning only if BendDiameterDimensionsEnabled is set to true.
BendDiameterDimensionType
 Identifies what type of bend diameter dimensions will be shown (radial or diameter).
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
CanBeCopied
 Determine if this ElementType can create a copy
 (Inherited from ElementType.)
CanBeDeleted
 Determine if this ElementType can be deleted
 (Inherited from ElementType.)
CanBeRenamed
 Determine if this ElementType can be renamed
 (Inherited from ElementType.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
DetailLevel
 Identifies the level of detail in which the Bending Detail will be represented.
DiameterDimensionTypeId
 Identifies the Id of the diameter dimension type which is used to show dimensions.
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
FamilyName
 Gets the family name of this element type.
 (Inherited from ElementType.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsModifiable
 Identifies if the element is modifiable.
 (Inherited from Element.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
MultipleValuesIndicatorOption
 Identifies the option of how multiple values will be represented.
Name
Set the name for the ElementType.
 (Inherited from ElementType.)
OrthogonalAndOverallDimesionsEnabled
 Identifies if orthogonal and overall dimensions are displayed.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
RadialDimensionTypeId
 Identifies the Id of the radial dimension type which is used to show dimensions.
RepresentaionOf3DShapes
 Identifies how the Bending Detail will represent the 3D shapes.
SegmentLengthDimensionsEnabled
 Identifies if any segment length dimensions will be shown or not.
SegmentLengthDimensionsForHooksEnabled
 Identifies if segment length dimensions for hooks will be shown or not. If this property is true, the SegmentLengthDimensionsEnabled should also be true to see segment length dimensions for hooks.
SegmentLengthDimensionsOffset
 Identifies the offset of the segment length dimensions.
SegmentLengthDimensionTextPosition
 Identifies the text position with respect to dimension line.
SegmentLengthDimensionTypeId
 Identifies the Id of the linear dimension type which is used to show segments length.
SegmentLengthsDisplayOption
 Identifies if the segment lengths are represented using dimensions or just as text.
SegmentLengthsForArcsDisplayOption
 Identifies if the arc segment lengths are represented using dimensions or just as text. Only RebarShapes whose definition is RebarShapeDefinitionByArc are considered that have arc segments.
SegmentsRepresentation
 Identifies how the bending detail will represent the segments of the bar.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
VersionGuid
 Get the element version Guid.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace